       01  PERSON-RECORD.
           05  FIRST-NAME        PIC X(20).
           05  LAST-NAME         PIC X(20).
           05  DATE-OF-BIRTH     PIC 9(8).    *> Format: YYYYMMDD
           05  COUNTRY           PIC X(20).
