       IDENTIFICATION DIVISION.
       PROGRAM-ID. SORTALG1.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO 'INPUT.DATASET'.
           SELECT OUTFILE ASSIGN TO 'OUTPUT.LNAME.SORTED'.

       DATA DIVISION.
       FILE SECTION.
       FD  INFILE.
       COPY PERSONREC.

       FD  OUTFILE.
       COPY PERSONREC.

       WORKING-STORAGE SECTION.
       01  WS-PERSON-RECORD.
           COPY PERSONREC.

       PROCEDURE DIVISION.
           SORT SORT-FILE
               ON ASCENDING KEY LAST-NAME
               USING INFILE
               GIVING OUTFILE.
           STOP RUN.
